reinstatement_title = "# Восстановление во фракцию"
reinstatement_submission = (
    "### Подача заявления\n"
    "Чтобы восстановиться во фракцию воспользуйтесь кнопкой снизу."
)
reinstatement_requirements = """### Требования к заявлению
1. Восстановление доступно со звания Старший Сержант.
2. Восстановление невозможно, если имя или фамилия были изменены.
3. Причиной увольнения должно быть собственное желание или перевод."""
reinstatement_system = """### Система восстановления
- Звание определяется по результатам переаттестации.
- Итоговый ранг не может быть выше указанного в военном билете.
- Максимальное звание для восстановления Младший лейтенант."""

role_title = "# Подача заявления на роль"
role_submission = (
    "### Подача заявления\nЧтобы подать заявление на роль воспользуйтесь кнопкой снизу."
)
role_requirements = """### Информация
1. Убедитесь в достоверности введённых данных.
2. Заявления рассматриваются в течение 24 часов.
"""

supply_audit_title = "# Аудит выдачи снаряжения"
supply_audit_description = (
    "### Аудит выдачи снаряжения\n"
    "Вы можете отправить в аудит запись о чистке, выдаче склада."
)

timeoff_title = "# Подача заявления на отгул"
timeoff_submission = "### Подача заявления\nЧтобы подать заявление на отгул воспользуйтесь кнопкой снизу."
timeoff_description = """### Информация
1. Заявления доступны со звания Старший сержант.
2. Заявления можно подать только на сегодняшний день.
3. Разрешено брать отгул только один раз в день.
4. Запрещено брать отгул в промежуток с 20:30 до 21:30."""

patrol_title = "# 🏹 Запрос формы ССО"
patrol_rules = """
### Правила ношения формы:
1. Запрос действителен до рестарта (03:00 МСК).
2. Запрос действителен только на СОВМЕСТНУЮ работу.
3. Во время патруля вы находитесь полностью под руководством ССО.
4. Перед подачей запроса нужно получить устное одобрение в <#1254025672402145350>
5. Если вам одобрили запрос — наденьте форму ССО в раздевалке и сообщите о готовности
6. Закончили патруль — сняли форму. Бегать в ней одному — нарушение.
7. Если бойцов нет — ждите их в <#1254025672402145350>. Самодеятельность запрещена.
### Правила проведения патруля:
1. Не афкшим и не втыкаем — всегда находимся рядом с группой ССО.
2. Если упали (300-й) — сообщите об этом **1 раз**, вас поднимут.
3. Если добили — заряжайтесь на ГС и ждите, сообщив об этом **1 раз**.
4. Скринить налёты вам не нужно. Поставки и ограбления — можно
"""

logistics_description = """### Информация
1. Порядок поставок определяет поставщик вне зависимости от времени подачи запроса.
2. Все поданные запросы обрабатываются в день их подачи. 
3. Запросы не переносятся на следующий день и аннулируются в конце текущих суток.
4. Поставщик может доставить поставку по своей инициативе без запроса.
"""