import re


class RankIndex:
    """Индексы званий для проверок прав доступа"""

    PRIVATE = 0  # Рядовой
    CORPORAL = 1  # Ефрейтор
    JUNIOR_SERGEANT = 2  # Младший сержант
    SERGEANT = 3  # Сержант
    SENIOR_SERGEANT = 4  # Старший сержант
    SERGEANT_MAJOR = 5  # Старшина
    WARRANT_OFFICER = 6  # Прапорщик
    SENIOR_WARRANT = 7  # Старший прапорщик
    JUNIOR_LIEUTENANT = 8  # Младший лейтенант
    LIEUTENANT = 9  # Лейтенант
    SENIOR_LIEUTENANT = 10  # Старший лейтенант
    CAPTAIN = 11  # Капитан
    MAJOR = 12  # Майор
    LIEUTENANT_COLONEL = 13  # Подполковник
    COLONEL = 14  # Полковник
    MAJOR_GENERAL = 15  # Генерал-майор
    LIEUTENANT_GENERAL = 16  # Генерал-лейтенант
    COLONEL_GENERAL = 17  # Генерал-полковник
    ARMY_GENERAL = 18  # Генерал армии

RANKS_SHORT = [
    "Р-й",
    "Еф-р",
    "Мл. С-т",
    "С-т",
    "Ст. С-т",
    "С-на",
    "Пр-к",
    "Ст. Пр-к",
    "Мл. Л-т",
    "Л-т",
    "Ст. Л-т",
    "К-н",
    "М-р",
    "П/п-к",
    "П-к",
    "Ген.-м",
    "Ген.-л",
    "Ген.-п",
    "Ген. а.",
]

RANKS = [
    "Рядовой",
    "Ефрейтор",
    "Младший сержант",
    "Сержант",
    "Старший сержант",
    "Старшина",
    "Прапорщик",
    "Старший прапорщик",
    "Младший лейтенант",
    "Лейтенант",
    "Старший лейтенант",
    "Капитан",
    "Майор",
    "Подполковник",
    "Полковник",
    "Генерал-майор",
    "Генерал-лейтенант",
    "Генерал-полковник",
    "Генерал армии",
]

AVAILABLE_FOR_REINSTATEMENT = RANKS[4:12]  # "Старший сержант" -> "Капитан"

SUPPLY_ITEMS = {
    "Оружие": [
        "АК-74М",
        "Кольт М16",
        "Кольт 416 Канада",
        "ФН СКАР-Т",
        "Штейр АУГ-А3",
        "Таурус Бешеный бык",
        "Таурус Бешеный бык МК2",
        "CAP M249",
        "Обрез",
        "Тип 97",
        "Сайга-12К",
        "РП-16",
        "АС Перевал",
        "ХК Г63-К"
    ],
    "Броня": ["Средний бронежилет", "Тяжелый бронежилет"],
    "Медикаменты": [
        "Комплект мед. помощи",
        "Армейская аптечка",
        "Обезболивающее",
        "Дефибриллятор",
    ],
    "Прочее": ["Бодикамеры", "Патроны", "Материалы"],
}

SUPPLY_LIMITS = {
    "Оружие": 3,  # Лимит на категорию Оружие (суммарно)
    "Материалы": 2000,  # Материалы
    "Броня": 20,  # Бронежилеты
    "Медикаменты": 55,  # Общий лимит на медикаменты
    "Армейская аптечка": 25,  # Конкретный предмет
    "Обезболивающее": 15,  # Конкретный предмет
    "Дефибриллятор": 15,  # Конкретный предмет
}

MATERIAL_PRICE = 8

nickname_regex = re.compile("^([А-яЁё][а-яё]+) ([А-яЁё][а-яё]+)$")


LOADING_MESSAGES = [
    "📐 Триангулируем...",
    "🔮 Прорицаем...",
    "🌊 Резонируем...",
    "🧠 Синтезируем...",
    "🕳️ Экстраполируем...",
    "🌀 Осциллируем...",
    "🔗 Коррелируем...",
    "🧬 Секвенируем...",
    "⚡ Индуцируем...",
    "🎛️ Модулируем...",
    "🧭 Навигируем...",
    "🔭 Фокусируем...",
    "🧊 Кристаллизуем...",
    "🗺️ Картографируем...",
    "🪄 Материализуем...",
    "🏗️ Реконструируем...",
    "⚗️ Дистиллируем...",
    "🧩 Компонуем...",
    "📡 Локализуем...",
    "🌫️ Абстрагируем...",
    "🔄 Рекурсируем...",
    "➕ Интегрируем...",
    "🎯 Аппроксимируем...",
    "✅ Верифицируем...",
    "📊 Векторизуем...",
    "🎥 Проецируем...",
    "🕵️ Профилируем...",
    "🧮 Дифференцируем...",
    "⚖️ Стратифицируем...",
    "🌪️ Флуктуируем...",
    "🔁 Транспонируем...",
    "✍️ Аннотируем...",
    "❄️ Сублимируем...",
    "🗂️ Каталогизируем...",
    "🗣️ Артикулируем...",
    "🔀 Реконфигурируем...",
    "🌗 Гравитируем к ответу...",
    "🧫 Трансмутируем данные...",
    "🧷 Валидируем гипотезу...",
]